# Создайте модуль с функциями для математических операций n/
# и используйте его в другом файле

import math
def sum_with_params(a, b):
    return math.fsum([a,b])


# Напишите функцию, которая принимает список чисел и возвращает их сумму. n/
# Создайте модуль, содержащий эту функцию и используйте его в основном файле n/
# для расчета суммы чисел из списка

def sum_list(my_list):
    return sum(my_list)


# Считайте с клавиатуры пять чисел, сохраните их в список и выведите только те, которые больше 10.



# Считайте с клавиатуры любое количество чисел до тех пор, пока пользователь не введёт 0. n/
# Сохраните все введённые числа в файл numbers.txt.#



# Считайте с клавиатуры десять чисел, сохраните их в список, отберите только чётные и n/
# запишите их в файл even.txt. Затем прочитайте файл и выведите содержимое на экран.