# Напишите программу, которая выводит на экран/n
# результат сложения двух чисел, например, 3 + 5

a = int(input('введите число 1: '))
b = int(input('введите число 2: '))

c = (a + b)
print(c)

""" Напишите программу, которая выводит строку:  "I love (hate?) Python """

print(str('I love (hate?) Python'))